# St7SetCavityFluidName

Sets the name of the specified cavity fluid layout.

long St7SetCavityFluidName(long uID, long CavityID, char* LayoutName)

Input Parameters

uID

Strand7 model file ID.

CavityID

Cavity fluid layout ID.

LayoutName

Name of the layout.